Tekla.Structures.Model.History.ModificationStamp
The ModificationStamp class provides the modification stamp for the objects of the model
that is currently open in Tekla Structures.

Tekla.Structures.Model.History.ModificationStamp._CurrentModStamp
Current Stamp for modified or new objects

Tekla.Structures.Model.History.ModificationStamp._CurrentSaveStamp
Current SaveStamp for multi-user model

Tekla.Structures.Model.History.ModificationStamp.LocalStamp
The modification stamp for the local changes.

Tekla.Structures.Model.History.ModificationStamp.ServerStamp
The modification stamp from the multi-user server for the external changes caused by
the saving of the multi-user model.

Tekla.Structures.Model.History.ModificationStamp.Guid
Guid representation
Method Tekla.Structures.Model.History.GetCurrentModificationStamp() now obsoleted,
instead GetCurrentModificationStampGuid() should be used which returns Guid-formatted strings.
This property can be used to convert a value stored from previous GetCurrentModificationStamp() calls

Tekla.Structures.Model.History.ModificationStamp.#ctor
Creates a new modification stamp instance where the current modification stamp is 0.
Can be used for fetching all the created or deleted model objects from the model history.

Tekla.Structures.Model.History.ModificationStamp.#ctor(System.Int32,System.Int32)
Creates a new modification stamp instance with the given local and server stamps.
Can be used for fetching from the model history all the model objects that have been created
or deleted after the specified stamp.
LocalStamp: The local stamp to be used for fetching the model changes after the stamp.
ServerStamp: The server stamp for fetching the external multi-user or synchronized
model changes after the stamp.